Run terraform plan
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=tf-state-devops-2025q2]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=tf-state-devops-2025q2]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=tf-state-devops-2025q2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.terraform_state will be created
  + resource "aws_s3_bucket" "terraform_state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tf-state-devops-2025q2"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "tf-state-devops-2025q2"
          + "Project"     = "rsschool-devops"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "tf-state-devops-2025q2"
          + "Project"     = "rsschool-devops"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform_state must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "terraform_state" {
      ~ block_public_acls       = false -> true
      ~ block_public_policy     = false -> true
      ~ bucket                  = "tf-state-devops-2025q2" -> (known after apply) # forces replacement
      ~ id                      = "tf-state-devops-2025q2" -> (known after apply)
      ~ ignore_public_acls      = false -> true
      ~ restrict_public_buckets = false -> true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform_state must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "terraform_state" {
      ~ bucket                = "tf-state-devops-2025q2" -> (known after apply) # forces replacement
      ~ id                    = "tf-state-devops-2025q2" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = true -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.terraform_state must be replaced
-/+ resource "aws_s3_bucket_versioning" "terraform_state" {
      ~ bucket                = "tf-state-devops-2025q2" -> (known after apply) # forces replacement
      ~ id                    = "tf-state-devops-2025q2" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
          ~ status     = "Disabled" -> "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 3 to destroy.